--==============================================================================================================
-- 1. Создайте в домашней директории файл .my.cnf, задав в нем логин и пароль, который указывался при установке.
--==============================================================================================================
[mysql]
user=root
password=my8sql

--==============================================================================================================
-- 2. Создайте базу данных example, разместите в ней таблицу users, состоящую из двух столбцов, 
-- числового id и строкового name.
--==============================================================================================================

CREATE database example; 
create table example.users
( id    serial,  
  name  varchar(255) not null
);

--==============================================================================================================
-- 3. Создайте дамп базы данных example из предыдущего задания, 
-- разверните содержимое дампа в новую базу данных sample.
--==============================================================================================================

CREATE database sample; 

mysqldump -u root -p --add_drop_table example > example_dump.sql
mysql sample < example_dump.sql
 
--==============================================================================================================
-- 4. Ознакомьтесь более подробно с документацией утилиты mysqldump.
-- Создайте дамп единственной таблицы help_keyword базы данных mysql. 
-- Причем добейтесь того, чтобы дамп содержал только первые 100 строк таблицы.
--==============================================================================================================

mysqldump -u root -p mysql  help_keyword -w"1=1 order by help_keyword_id limit 100" > hk_dump.sql

